# Taps
tap "hashicorp/tap"
tap "merzoukemansouri/homebrew"
tap "mongodb/brew"
tap "supabase/tap"
tap "theboredteam/boring-notch"

# Shell & terminal
brew "fzf"
brew "zoxide"
brew "eza"
brew "fd"
brew "bat"
brew "ripgrep"
brew "tmux"
brew "tldr"
brew "tree"

# Git
brew "gh"
brew "lazygit"
brew "git-filter-repo"
brew "merzoukemansouri/homebrew/gup"
brew "merzoukemansouri/homebrew/pgit"

# Editors & LSP
brew "neovim"
brew "jdtls"

# Languages & runtimes
brew "fnm"
brew "uv"
brew "pipx"
brew "maven"

# Kubernetes & infra
brew "k9s"
brew "kubectx"
brew "hashicorp/tap/vault"

# Databases
brew "postgresql@14"
brew "postgresql@18"
brew "redis"
brew "mongodb/brew/mongosh"

# Cloud & services
brew "gh"
brew "stripe-cli"
brew "supabase/tap/supabase"
brew "phrase-cli"
brew "syncthing"

# APIs & dev tools
brew "httpie"
brew "jq"
brew "shellcheck"
brew "angular-cli"

# Media & image
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"
brew "optipng"
brew "pngquant"

# Misc
brew "btop"
brew "lazydocker"
brew "serve"
brew "mermaid-cli"
brew "catimg"
brew "himalaya"
brew "sl"
brew "cowsay"
brew "ack"

# Casks
cask "orbstack"
cask "bruno"
cask "dbeaver-community"
cask "drawio"
cask "font-fira-code"
cask "gcloud-cli"
cask "maccy"
cask "miniforge"
cask "mongodb-compass"
cask "redis-insight"
cask "stats"
cask "vlc"
cask "boring-notch"
cask "voiceink"
cask "copilot-cli"
cask "slack"
